{
  "AAA": 44,
  "AAC": 49,
  "AAG": 46,
  "AAT": 62,
  "ACA": 71,
  "ACC": 48,
  "ACG": 66,
  "ACT": 72,
  "AGA": 88,
  "AGC": 69,
  "AGG": 92,
  "AGT": 87,
  "ATA": 84,
  "ATC": 35,
  "ATG": 38,
  "ATT": 51,
  "CAA": 77,
  "CAC": 80,
  "CAG": 56,
  "CAT": 89,
  "CCA": 82,
  "CCC": 70,
  "CCG": 57,
  "CCT": 81,
  "CGA": 94,
  "CGC": 54,
  "CGG": 78,
  "CGT": 75,
  "CTA": 91,
  "CTC": 53,
  "CTG": 40,
  "CTT": 64,
  "GAA": 37,
  "GAC": 36,
  "GAG": 47,
  "GAT": 43,
  "GCA": 52,
  "GCC": 34,
  "GCG": 42,
  "GCT": 55,
  "GGA": 61,
  "GGC": 33,
  "GGG": 68,
  "GGT": 45,
  "GTA": 59,
  "GTC": 41,
  "GTG": 39,
  "GTT": 50,
  "TAA": 93,
  "TAC": 63,
  "TAG": 96,
  "TAT": 76,
  "TCA": 85,
  "TCC": 67,
  "TCG": 60,
  "TCT": 73,
  "TGA": 95,
  "TGC": 86,
  "TGG": 83,
  "TGT": 90,
  "TTA": 74,
  "TTC": 58,
  "TTG": 65,
  "TTT": 79
}
